docs/toddler-trilemma.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="UTF-8">
<link rel="alternate"
      type="application/rss+xml"
      href="https://mjgpy3.github.io/me/rss.xml"
      title="RSS feed for https://mjgpy3.github.io/me">
<title>Toddler Trilemma</title>
<meta name="author" content="Michael 'Gilli' Gilliland">
<meta name="referrer" content="no-referrer">
<link href= "static/style.css" rel="stylesheet" type="text/css" />
<link rel="icon" href="static/favicon.ico">
<!-- Global site tag (gtag.js) - Google Analytics -->
</head>
<body>
<div id="preamble" class="status"><div class="header">
  <a href="https://mjgpy3.github.io/me">Gilli's Land</a>
</div></div>
<div id="content">
<div class="post-date">04 Apr 2022</div><h1 class="post-title"><a href="https://mjgpy3.github.io/me/toddler-trilemma.html">Toddler Trilemma</a></h1>
<p>
Before I became the parent of a toddler, there were phrases I never imagined myself saying. "Because I said so" and "because that's how it is" are answers that I've never found satisfactory &#x2013; why should a toddler? Well, lo and behold, I find myself using phrases like these more than I'd care to admit as a defense against the endless barrage of <i>why?</i>.
</p>

<p>
The other day, while indulging a particularly long stream of <i>why?</i>, my mind began to wonder and I started to connect the situation to a bit of formal logic I studied eons ago.
</p>

<p>
I don't think about formal logic often but one thing that's always stuck with me is the <a href="https://en.wikipedia.org/wiki/M%C3%BCnchhausen_trilemma">Münchhausen trilemma</a>.
</p>

<p>
This "trilemma" asserts that there are only three ways to actually prove something:
</p>
<ul class="org-ul">
<li>circular reasoning</li>
<li>infinite regression</li>
<li>argument from authority/axiom</li>
</ul>

<p>
See the connection?
</p>

<p>
Answering "because I said so" is a lot like an argument from authority or an axiomatic argument. In this case, it's so, well, because I said it is &#x2013; I'm the authority.
</p>

<p>
Responding "because that's how it is" is a circular argument, albeit a boring one without any little arguments in between.
</p>

<p>
What about an infinite regression argument? Well logicians, hear us parents out, these don't exist. A toddler's endurance in asking "why?" far surpasses that of the parent in articulating coherent responses. Münchhausen I see your trilemma; meet the Toddler's Dilemma; Occam would be so proud.
</p>
<div class="taglist"><a href="https://mjgpy3.github.io/me/tags.html">Tags</a>: <a href="https://mjgpy3.github.io/me/tag-parenting.html">parenting</a> <a href="https://mjgpy3.github.io/me/tag-philosophy.html">philosophy</a> <a href="https://mjgpy3.github.io/me/tag-logic.html">logic</a> </div></div>
<div id="postamble" class="status"></div>
</body>
</html>
